[
  {
    "text": "Small businesses are the backbone of this country, and affordable access to the internet is vital to many a small businesses' survival. Without net neutrality, an online presence could become prohibitive, and put our very existence in jeopardy by posing a dire hardship with practices such as high costs, throttling, and even blocking or censoring...",
    "source": "Susan M. Wald, The Waldo Tribune",
    "link": "http://www.waldotribune.com/"
  },
  {
    "text": "Equal access to Internet services are vital to my business. Because there is no true competition in Internet providers in my area, (only Comcast is available), it is vital that I have equal and unhindered access to all internet content.",
    "source": "Eric Henderson, Paragon Machinery",
    "link": "https://www.paragonmachinery.net/"
  },
  {
    "text": "I am the President of Intex Solutions, Inc.; a small company with about 100 employees. I strongly support \"net neutrality\" and have deep concerns about how not having it will affect my small business.",
    "source": "David Rosenstein, Intex Solutions, Inc.",
    "link": "http://www.intexsolutions.com/"
  },
  {
    "text": "Small Not-For-Profits and Churches will be hurt irreparably if Internet Neutrality is destroyed. We cannot pay for priority service for our website.",
    "source": "Paul Horne, Church of Our Savior MCC",
    "link": "http://www.churchofoursaviormcc.org/"
  },
  {
    "text": "We specialize in short term vacation rentals and almost all of our business comes from our website and social media pages. The FCC killing net neutrality could put us in a really bad spot and possibly ruin our business. We support the CRA to bring net neutrality back and keep the web open and free for everyone.",
    "source": "Christian Pugh, Beach Tyme Properties",
    "link": "https://www.beachtymeproperties.com/"
  },
  {
    "text": "My farm depends on an open internet for advertising. We could never afford to compete with big Agriculture firms in paying for a fast lane.",
    "source": "Polly Matzinger, Ambling Brook Farm",
    "link": "http://www.amblingbrookfarm.com/"
  },
  {
    "text": "As both an independent author/artist and a freelancer, I depend on equal access to the internet to reach customers and clients. Small businesses are the life force of local economies and innovation across the country. Making the internet pay-to-play will give an unfair advantage to large corporations that already have more resources.",
    "source": "Joseph VanBuren, Sykophunk Productions",
    "link": "http://sykophunk.com/"
  },
  {
    "text": "Net neutrality is critical to the success and longevity of my business, and to the employment of my employees. Please support strong Net Neutrality protections (ie Title II).",
    "source": "Kelly Bell, Gotham City Drupal",
    "link": "http://www.gothamcitydrupal.com/"
  },
  {
    "text": "Taking away net neutrality will hurt my small business. Having to pay more to access my website limits the number of customers who I will have. Please choose your constituents over your pocket book.",
    "source": "Christopher Landry, Ascent Running Coaching LLC",
    "link": "https://ascentrunningcoaching.com/"
  },
  {
    "text": "Our business relies on a fair and open internet. Please protect this right for everyone so that us and many others can continue to see the benefits of fair access for all.",
    "source": "Christopher Dasbach, Thunder Bunny Labs LLC",
    "link": "https://www.thunderbunnylabs.com/"
  },
  {
    "text": "I believe that net neutrality is important for the future of business in our country",
    "source": "Reed Morelli, Hale Hookah",
    "link": "https://www.facebook.com/HookahHawaii/"
  },
  {
    "text": "Getting rid of Net Neutrality is a terrible idea. The internet is the greatest invention of our time, please do not let a handful of corporations alter it for their own gain.",
    "source": "Mike Brophy, Generation Tech Computers",
    "link": "https://www.facebook.com/GenerationTechComputers/"
  },
  {
    "text": "I rely on my access to the internet to be able to manage my business. This involves both uploading and downloading data. The repeal to net neutrality inhibits this tremendously and I am now spending more per month to do the same thing I've been doing for years.",
    "source": "Jon Stump, Jon Stump Photography",
    "link": "https://www.instagram.com/jonstumpphotography/"
  },
  {
    "text": "As a small business entrepreneur, an open and free internet is essential to my marketing. I strongly urge you, as a decision maker in this country to issue a \"Resolution of Disapproval\" to restore net neutrality. Thank for serving the people of this country.",
    "source": "Christopher Macor, So You Wanna Play Guitar",
    "link": "https://soyouwannaplayguitar.com/"
  },
  {
    "text": "There's no excuse at this late date to be \"undecided\" about net neutrality. Everyone deserves to have fair access to the internet without worrying about censorship, propaganda, throttling and having to pay even more for speed and access. Are you in support of a real democracy and free speech?",
    "source": "Barbara Magnuson, Pronghorn Wildlife Photography",
    "link": "https://www.pronghornwildlifephotography.com/index"
  },
  {
    "text": "Freelancers have already seen steady reductions in fees and difficulty in securing new business, which reduces our earnings and increases our costs. If ATT, Comcast, et al abolish net neutrality, it will further hamper our ability to do business, and in many cases, push us into collapse of our businesses.",
    "source": "Charles Floyd, CFDI",
    "link": "https://www.charlesfloyddesignandillustration.com/"
  },
  {
    "text": "Net neutrality is essential for a healthy democracy and to enable healthy economic competition. My business relies on making our information and services easily available online. I urge you to support net neutrality at this crucial time.",
    "source": "Susan Henning, Advance Physical Therapy",
    "link": "https://advance-physicaltherapy.com/"
  },
  {
    "text": "As a new and small company, we support NN so that we can give readers the same level of access to our website as the large companies in our industry can. Without NN, we are vulnerable to having large companies pay their way while smaller companies like us get left behind.",
    "source": "Daniel Eagen, The World's Empire, LLC.",
    "link": "https://www.theworldsempire.com/"
  },
  {
    "text": "As a web designer, the thought of ending Net Neutrality is very concerning. I will now have to explain to my customers that no matter how much they spend on SEO or marketing their website, their visibility and success will ultimately be in the hands of the ISP.",
    "source": "Dean Nixon, Dean Nixon Design",
    "link": "http://www.deannixondesign.com/"
  },
  {
    "text": "Net neutrality is very important for our company and we will only stand behind public officials who stand for net neutrality.",
    "source": "Cote Licciardi, RAM Computer Repair",
    "link": "http://www.ramcomputerrepair.com/"
  },
  {
    "text": "As a small business with most of our sales online, it's essential for us to have equal access to quality internet delivery to our customers. We manufacture award winning audio headphones in San Diego, CA which are distributed all over the world, but we're a small self-funded company ... It's hard enough being a US manufacturer of consumer goods, don't make it harder.",
    "source": "Dan Clark, MrSpeakers, Inc",
    "link": "https://www.mrspeakers.com/"
  },
  {
    "text": "Net neutrality is ESSENTIAL to the the survival of my small business.",
    "source": "Beth Rontal, Partnership In Wellness",
    "link": "http://www.partnershipinwellness.com/"
  },
  {
    "text": "As a small business owner, net neutrality is vital to our work.",
    "source": "Marilyn Mullen, Mullen Mediation",
    "link": "http://www.mullenmediation.org/"
  },
  {
    "text": "Developing urgently needed solar innovations requires full ability to communicate. Restricting internet interaction is a business stifler. We need biz to grow, not struggle.",
    "source": "Paul Klinkman & Liberty Goodwin, Klinkman Solar Design",
    "link": "http://www.klinkmansolar.com/"
  },
  {
    "text": "I have a life coaching business. My husband has 2 graphic design start-up companies. We don't make a full living between us at this time. It would kill both our struggling businesses if we had to compete for broadband space.",
    "source": "Cheryn English, Creative Life Strategies",
    "link": "https://www.creativelifestrategies.org/"
  }
]
